---
kind: type
id: T:Autodesk.Revit.DB.Architecture.BalusterInfo
source: html/96a6917f-9f36-2e9a-3f94-a42ff103fff0.htm
---
# Autodesk.Revit.DB.Architecture.BalusterInfo

The class represents an instance of a railing baluster or post.

## Syntax (C#)
```csharp
public class BalusterInfo : IDisposable
```